<a href="https://colab.research.google.com/github/sathwika0324/Assignment/blob/main/Untitled1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [31]:
import pandas as pd
from tabulate import tabulate

In [33]:
# Load the dataset
df = pd.read_csv('train.csv')  # Make sure 'train.csv' is in the current working directory

# Display the first few rows to verify the data is loaded correctly
print(tabulate(df.head(), headers='keys', tablefmt='grid'))

+----+--------------+----------------------------------+------------+--------+---------------------+-------------+----------------+--------------+------------+----------+-----------+---------+-------------+---------+
|    |   Unnamed: 0 | Name                             | Location   |   Year |   Kilometers_Driven | Fuel_Type   | Transmission   | Owner_Type   | Mileage    | Engine   | Power     |   Seats | New_Price   |   Price |
+====+==============+==================================+============+========+=====================+=============+================+==============+============+==========+===========+=========+=============+=========+
|  0 |            1 | Hyundai Creta 1.6 CRDi SX Option | Pune       |   2015 |               41000 | Diesel      | Manual         | First        | 19.67 kmpl | 1582 CC  | 126.2 bhp |       5 | nan         |   12.5  |
+----+--------------+----------------------------------+------------+--------+---------------------+-------------+----------------+--------------+------------+----------+-----------+---------+-------------+---------+
|  1 |            2 | Honda Jazz V                     | Chennai    |   2011 |               46000 | Petrol      | Manual         | First        | 13 km/kg   | 1199 CC  | 88.7 bhp  |       5 | 8.61 Lakh   |    4.5  |
+----+--------------+----------------------------------+------------+--------+---------------------+-------------+----------------+--------------+------------+----------+-----------+---------+-------------+---------+
|  2 |            3 | Maruti Ertiga VDI                | Chennai    |   2012 |               87000 | Diesel      | Manual         | First        | 20.77 kmpl | 1248 CC  | 88.76 bhp |       7 | nan         |    6    |
+----+--------------+----------------------------------+------------+--------+---------------------+-------------+----------------+--------------+------------+----------+-----------+---------+-------------+---------+
|  3 |            4 | Audi A4 New 2.0 TDI Multitronic  | Coimbatore |   2013 |               40670 | Diesel      | Automatic      | Second       | 15.2 kmpl  | 1968 CC  | 140.8 bhp |       5 | nan         |   17.74 |
+----+--------------+----------------------------------+------------+--------+---------------------+-------------+----------------+--------------+------------+----------+-----------+---------+-------------+---------+
|  4 |            6 | Nissan Micra Diesel XV           | Jaipur     |   2013 |               86999 | Diesel      | Manual         | First        | 23.08 kmpl | 1461 CC  | 63.1 bhp  |       5 | nan         |    3.5  |
+----+--------------+----------------------------------+------------+--------+---------------------+-------------+----------------+--------------+------------+----------+-----------+---------+-------------+---------+

In [4]:
# Function to clean and convert columns by removing non-numeric characters
def clean_numeric_column(column):
    # Remove non-numeric characters and convert to float
    return pd.to_numeric(column.str.replace(r'[^0-9.]', '', regex=True), errors='coerce')

In [5]:
# Clean numerical columns
numerical_columns = ['Mileage', 'Engine', 'Power']  # Update this list based on your dataset
for col in numerical_columns:
    if col in df.columns:
        df[col] = clean_numeric_column(df[col])  # Clean the column

 Look for the missing values in all the columns and either impute them (replace with mean,
median, or mode) or drop them. Justify your action for this task.

In [6]:
# Check for missing values
missing_values = df.isnull().sum()
print("Missing values in each column:\n", missing_values)# Check for missing values

Missing values in each column:
 Unnamed: 0              0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 36
Power                  36
Seats                  38
New_Price            5032
Price                   0
dtype: int64

In [7]:
# Impute numerical columns with median, as it is less affected by outliers
for col in numerical_columns:
    if col in df.columns:
        # Fill missing values with the median of the column and assign back
        df[col] = df[col].fillna(df[col].median())

In [8]:
# Impute categorical columns with mode (most frequent value)
categorical_columns = ['Seats']  # Update this list based on your dataset
for col in categorical_columns:
    if col in df.columns:
        df[col] = df[col].fillna(df[col].mode()[0])  # Impute with mode

In [9]:
# Drop rows where the target variable 'Price' is missing, since it's the focus of the analysis
df.dropna(subset=['Price'], inplace=True)

In [10]:
# Check again to confirm no missing values remain
missing_values_after = df.isnull().sum()
print("\nMissing values after handling:\n", missing_values_after)

Missing values after handling:
 Unnamed: 0              0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 0
Engine                  0
Power                   0
Seats                   0
New_Price            5032
Price                   0
dtype: int64

Remove the units from some of the attributes and only keep the numerical values (for
example remove kmpl from “Mileage”, CC from “Engine”, bhp from “Power”, and lakh from
“New_price”).

In [11]:
def clean_numeric_column(column):
    # Ensure the column is treated as a string, then remove non-numeric characters
    return pd.to_numeric(column.astype(str).str.replace(r'[^0-9.]', '', regex=True), errors='coerce')

In [12]:
# Clean specific columns
if 'Mileage' in df.columns:
    df['Mileage'] = clean_numeric_column(df['Mileage'])

In [13]:
if 'Engine' in df.columns:
    df['Engine'] = clean_numeric_column(df['Engine'])

In [14]:
if 'Power' in df.columns:
    df['Power'] = clean_numeric_column(df['Power'])

In [15]:
if 'New_price' in df.columns:
    df['New_price'] = clean_numeric_column(df['New_price'])

In [34]:
# Display the cleaned DataFrmes
print(tabulate(df.head(), headers='keys', tablefmt='grid'))

+----+--------------+----------------------------------+------------+--------+---------------------+-------------+----------------+--------------+------------+----------+-----------+---------+-------------+---------+
|    |   Unnamed: 0 | Name                             | Location   |   Year |   Kilometers_Driven | Fuel_Type   | Transmission   | Owner_Type   | Mileage    | Engine   | Power     |   Seats | New_Price   |   Price |
+====+==============+==================================+============+========+=====================+=============+================+==============+============+==========+===========+=========+=============+=========+
|  0 |            1 | Hyundai Creta 1.6 CRDi SX Option | Pune       |   2015 |               41000 | Diesel      | Manual         | First        | 19.67 kmpl | 1582 CC  | 126.2 bhp |       5 | nan         |   12.5  |
+----+--------------+----------------------------------+------------+--------+---------------------+-------------+----------------+--------------+------------+----------+-----------+---------+-------------+---------+
|  1 |            2 | Honda Jazz V                     | Chennai    |   2011 |               46000 | Petrol      | Manual         | First        | 13 km/kg   | 1199 CC  | 88.7 bhp  |       5 | 8.61 Lakh   |    4.5  |
+----+--------------+----------------------------------+------------+--------+---------------------+-------------+----------------+--------------+------------+----------+-----------+---------+-------------+---------+
|  2 |            3 | Maruti Ertiga VDI                | Chennai    |   2012 |               87000 | Diesel      | Manual         | First        | 20.77 kmpl | 1248 CC  | 88.76 bhp |       7 | nan         |    6    |
+----+--------------+----------------------------------+------------+--------+---------------------+-------------+----------------+--------------+------------+----------+-----------+---------+-------------+---------+
|  3 |            4 | Audi A4 New 2.0 TDI Multitronic  | Coimbatore |   2013 |               40670 | Diesel      | Automatic      | Second       | 15.2 kmpl  | 1968 CC  | 140.8 bhp |       5 | nan         |   17.74 |
+----+--------------+----------------------------------+------------+--------+---------------------+-------------+----------------+--------------+------------+----------+-----------+---------+-------------+---------+
|  4 |            6 | Nissan Micra Diesel XV           | Jaipur     |   2013 |               86999 | Diesel      | Manual         | First        | 23.08 kmpl | 1461 CC  | 63.1 bhp  |       5 | nan         |    3.5  |
+----+--------------+----------------------------------+------------+--------+---------------------+-------------+----------------+--------------+------------+----------+-----------+---------+-------------+---------+

Change the categorical variables (“Fuel_Type” and “Transmission”) into numerical one hot
encoded value

In [17]:
# One-hot encode categorical variables
df = pd.get_dummies(df, columns=['Fuel_Type', 'Transmission'], drop_first=True)

In [35]:
# Display the updated DataFrame
print(tabulate(df.head(), headers='keys', tablefmt='grid'))

+----+--------------+----------------------------------+------------+--------+---------------------+-------------+----------------+--------------+------------+----------+-----------+---------+-------------+---------+
|    |   Unnamed: 0 | Name                             | Location   |   Year |   Kilometers_Driven | Fuel_Type   | Transmission   | Owner_Type   | Mileage    | Engine   | Power     |   Seats | New_Price   |   Price |
+====+==============+==================================+============+========+=====================+=============+================+==============+============+==========+===========+=========+=============+=========+
|  0 |            1 | Hyundai Creta 1.6 CRDi SX Option | Pune       |   2015 |               41000 | Diesel      | Manual         | First        | 19.67 kmpl | 1582 CC  | 126.2 bhp |       5 | nan         |   12.5  |
+----+--------------+----------------------------------+------------+--------+---------------------+-------------+----------------+--------------+------------+----------+-----------+---------+-------------+---------+
|  1 |            2 | Honda Jazz V                     | Chennai    |   2011 |               46000 | Petrol      | Manual         | First        | 13 km/kg   | 1199 CC  | 88.7 bhp  |       5 | 8.61 Lakh   |    4.5  |
+----+--------------+----------------------------------+------------+--------+---------------------+-------------+----------------+--------------+------------+----------+-----------+---------+-------------+---------+
|  2 |            3 | Maruti Ertiga VDI                | Chennai    |   2012 |               87000 | Diesel      | Manual         | First        | 20.77 kmpl | 1248 CC  | 88.76 bhp |       7 | nan         |    6    |
+----+--------------+----------------------------------+------------+--------+---------------------+-------------+----------------+--------------+------------+----------+-----------+---------+-------------+---------+
|  3 |            4 | Audi A4 New 2.0 TDI Multitronic  | Coimbatore |   2013 |               40670 | Diesel      | Automatic      | Second       | 15.2 kmpl  | 1968 CC  | 140.8 bhp |       5 | nan         |   17.74 |
+----+--------------+----------------------------------+------------+--------+---------------------+-------------+----------------+--------------+------------+----------+-----------+---------+-------------+---------+
|  4 |            6 | Nissan Micra Diesel XV           | Jaipur     |   2013 |               86999 | Diesel      | Manual         | First        | 23.08 kmpl | 1461 CC  | 63.1 bhp  |       5 | nan         |    3.5  |
+----+--------------+----------------------------------+------------+--------+---------------------+-------------+----------------+--------------+------------+----------+-----------+---------+-------------+---------+

Create one more feature and add this column to the dataset (you can use mutate function in
R for this). For example, you can calculate the current age of the car by subtracting “Year” value
from the current year.

In [19]:
from datetime import datetime
# Calculate the current year
current_year = datetime.now().year

In [20]:
# Create a new feature 'Car_Age'
df['Car_Age'] = current_year - df['Year']

In [36]:
# Display the updated DataFrame
print(tabulate(df.head(), headers='keys', tablefmt='grid'))

+----+--------------+----------------------------------+------------+--------+---------------------+-------------+----------------+--------------+------------+----------+-----------+---------+-------------+---------+
|    |   Unnamed: 0 | Name                             | Location   |   Year |   Kilometers_Driven | Fuel_Type   | Transmission   | Owner_Type   | Mileage    | Engine   | Power     |   Seats | New_Price   |   Price |
+====+==============+==================================+============+========+=====================+=============+================+==============+============+==========+===========+=========+=============+=========+
|  0 |            1 | Hyundai Creta 1.6 CRDi SX Option | Pune       |   2015 |               41000 | Diesel      | Manual         | First        | 19.67 kmpl | 1582 CC  | 126.2 bhp |       5 | nan         |   12.5  |
+----+--------------+----------------------------------+------------+--------+---------------------+-------------+----------------+--------------+------------+----------+-----------+---------+-------------+---------+
|  1 |            2 | Honda Jazz V                     | Chennai    |   2011 |               46000 | Petrol      | Manual         | First        | 13 km/kg   | 1199 CC  | 88.7 bhp  |       5 | 8.61 Lakh   |    4.5  |
+----+--------------+----------------------------------+------------+--------+---------------------+-------------+----------------+--------------+------------+----------+-----------+---------+-------------+---------+
|  2 |            3 | Maruti Ertiga VDI                | Chennai    |   2012 |               87000 | Diesel      | Manual         | First        | 20.77 kmpl | 1248 CC  | 88.76 bhp |       7 | nan         |    6    |
+----+--------------+----------------------------------+------------+--------+---------------------+-------------+----------------+--------------+------------+----------+-----------+---------+-------------+---------+
|  3 |            4 | Audi A4 New 2.0 TDI Multitronic  | Coimbatore |   2013 |               40670 | Diesel      | Automatic      | Second       | 15.2 kmpl  | 1968 CC  | 140.8 bhp |       5 | nan         |   17.74 |
+----+--------------+----------------------------------+------------+--------+---------------------+-------------+----------------+--------------+------------+----------+-----------+---------+-------------+---------+
|  4 |            6 | Nissan Micra Diesel XV           | Jaipur     |   2013 |               86999 | Diesel      | Manual         | First        | 23.08 kmpl | 1461 CC  | 63.1 bhp  |       5 | nan         |    3.5  |
+----+--------------+----------------------------------+------------+--------+---------------------+-------------+----------------+--------------+------------+----------+-----------+---------+-------------+---------+

In [23]:
# Print the column names to check for discrepancies
print("Column Names:\n", df.columns.tolist())

Column Names:
 ['Unnamed: 0', 'Name', 'Location', 'Year', 'Kilometers_Driven', 'Owner_Type', 'Mileage', 'Engine', 'Power', 'Seats', 'New_Price', 'Price', 'Fuel_Type_Electric', 'Fuel_Type_Petrol', 'Transmission_Manual', 'Car_Age']

Perform select, filter, rename, mutate, arrange and summarize with group by operations (or
their equivalent operations in python) on this dataset.

In [40]:
# Print current columns to verify
print("Current columns in DataFrame:", df.columns.tolist())

Current columns in DataFrame: ['Unnamed: 0', 'Name', 'Location', 'Year', 'Kilometers_Driven', 'Fuel_Type', 'Transmission', 'Owner_Type', 'Mileage', 'Engine', 'Power', 'Seats', 'New_Price', 'Price']

In [43]:
# Create a new feature 'Car_Age'
df['Car_Age'] = current_year - df['Year']

In [52]:
# Display only the first few rows of the selected columns
print("\nFirst Five Columns (Showing First 5 Rows):")
print(tabulate(first_five_columns.head(), headers='keys', tablefmt='grid'))

First Five Columns (Showing First 5 Rows):
+----+--------------+----------------------------------+------------+--------+---------------------+
|    |   Unnamed: 0 | Name                             | Location   |   Year |   Kilometers_Driven |
+====+==============+==================================+============+========+=====================+
|  0 |            1 | Hyundai Creta 1.6 CRDi SX Option | Pune       |   2015 |               41000 |
+----+--------------+----------------------------------+------------+--------+---------------------+
|  1 |            2 | Honda Jazz V                     | Chennai    |   2011 |               46000 |
+----+--------------+----------------------------------+------------+--------+---------------------+
|  2 |            3 | Maruti Ertiga VDI                | Chennai    |   2012 |               87000 |
+----+--------------+----------------------------------+------------+--------+---------------------+
|  3 |            4 | Audi A4 New 2.0 TDI Multitronic  | Coimbatore |   2013 |               40670 |
+----+--------------+----------------------------------+------------+--------+---------------------+
|  4 |            6 | Nissan Micra Diesel XV           | Jaipur     |   2013 |               86999 |
+----+--------------+----------------------------------+------------+--------+---------------------+

In [53]:
# Display the filtered data in a neat table format
print("\nSelected and Filtered Data (Showing First 5 Rows):")
print(tabulate(filtered_data.head(), headers='keys', tablefmt='grid'))

Selected and Filtered Data (Showing First 5 Rows):
+----+-------------------------------------+--------+---------+-----------+
|    | Name                                |   Year |   Price |   Car_Age |
+====+=====================================+========+=========+===========+
|  0 | Hyundai Creta 1.6 CRDi SX Option    |   2015 |   12.5  |         9 |
+----+-------------------------------------+--------+---------+-----------+
|  2 | Maruti Ertiga VDI                   |   2012 |    6    |        12 |
+----+-------------------------------------+--------+---------+-----------+
|  3 | Audi A4 New 2.0 TDI Multitronic     |   2013 |   17.74 |        11 |
+----+-------------------------------------+--------+---------+-----------+
|  5 | Toyota Innova Crysta 2.8 GX AT 8S   |   2016 |   17.5  |         8 |
+----+-------------------------------------+--------+---------+-----------+
|  6 | Volkswagen Vento Diesel Comfortline |   2013 |    5.2  |        11 |
+----+-------------------------------------+--------+---------+-----------+

In [54]:
# Display the renamed data in a neat table format
print("\nRenamed Data (Showing First 5 Rows):")
print(tabulate(renamed_data.head(), headers='keys', tablefmt='grid'))

Renamed Data (Showing First 5 Rows):
+----+-------------------------------------+--------+------------------+-----------+------------------+
|    | Name                                |   Year |   Used_Car_Price |   Car_Age |   Price_Per_Year |
+====+=====================================+========+==================+===========+==================+
|  0 | Hyundai Creta 1.6 CRDi SX Option    |   2015 |            12.5  |         9 |         1.38889  |
+----+-------------------------------------+--------+------------------+-----------+------------------+
|  2 | Maruti Ertiga VDI                   |   2012 |             6    |        12 |         0.5      |
+----+-------------------------------------+--------+------------------+-----------+------------------+
|  3 | Audi A4 New 2.0 TDI Multitronic     |   2013 |            17.74 |        11 |         1.61273  |
+----+-------------------------------------+--------+------------------+-----------+------------------+
|  5 | Toyota Innova Crysta 2.8 GX AT 8S   |   2016 |            17.5  |         8 |         2.1875   |
+----+-------------------------------------+--------+------------------+-----------+------------------+
|  6 | Volkswagen Vento Diesel Comfortline |   2013 |             5.2  |        11 |         0.472727 |
+----+-------------------------------------+--------+------------------+-----------+------------------+

In [27]:
# 4. Mutate by creating a new column (already done with Car_Age above)
# Assume we want to mutate to add a price per year feature
renamed_data['Price_Per_Year'] = renamed_data['Used_Car_Price'] / renamed_data['Car_Age']

In [55]:
# Display the arranged data in a neat table format
print("\nArranged Data (Showing First 5 Rows):")
print(tabulate(arranged_data.head(), headers='keys', tablefmt='grid'))

Arranged Data (Showing First 5 Rows):
+------+---------------------------------------------+--------+------------------+-----------+------------------+
|      | Name                                        |   Year |   Used_Car_Price |   Car_Age |   Price_Per_Year |
+======+=============================================+========+==================+===========+==================+
| 3952 | Land Rover Range Rover 3.0 Diesel LWB Vogue |   2017 |           160    |         7 |         22.8571  |
+------+---------------------------------------------+--------+------------------+-----------+------------------+
| 5620 | Lamborghini Gallardo Coupe                  |   2011 |           120    |        13 |          9.23077 |
+------+---------------------------------------------+--------+------------------+-----------+------------------+
| 5752 | Jaguar F Type 5.0 V8 S                      |   2015 |           100    |         9 |         11.1111  |
+------+---------------------------------------------+--------+------------------+-----------+------------------+
| 1457 | Land Rover Range Rover Sport SE             |   2019 |            97.07 |         5 |         19.414   |
+------+---------------------------------------------+--------+------------------+-----------+------------------+
| 1917 | BMW 7 Series 740Li                          |   2018 |            93.67 |         6 |         15.6117  |
+------+---------------------------------------------+--------+------------------+-----------+------------------+

In [57]:
# Display the first five rows of the summary in a neat table format
print("\nSummary (Average Price by Car Name - First 5 Rows):")
print(tabulate(summary.head(), headers='keys', tablefmt='grid'))

Summary (Average Price by Car Name - First 5 Rows):
+----+-----------------------------+-----------------+
|    | Name                        |   Average_Price |
+====+=============================+=================+
|  0 | Audi A3 35 TDI Attraction   |           16.5  |
+----+-----------------------------+-----------------+
|  1 | Audi A3 35 TDI Premium      |           19.25 |
+----+-----------------------------+-----------------+
|  2 | Audi A3 35 TDI Premium Plus |           18.9  |
+----+-----------------------------+-----------------+
|  3 | Audi A3 35 TDI Technology   |           22.5  |
+----+-----------------------------+-----------------+
|  4 | Audi A4 1.8 TFSI            |            9    |
+----+-----------------------------+-----------------+